# Настройки экрана
WIDTH = 800                 # Ширина окна
HEIGHT = 600                # Высота окна
FPS = 60                    # Кадры в секунду

# Цвета
BLACK = (0, 0, 0)           # Цвет для фона
WHITE = (255, 255, 255)     # Цвет для текста

# Настройки игрока
PLAYER_SPEED = 5            # Скорость корабля

# Настройки пуль
BULLET_SPEED = -10          # Отрицательное значение — пуля летит вверх

# Настройки врагов
ENEMY_SPEED = 3             # Скорость врага
ENEMY_SPAWN_DELAY = 1000    # Скорость появления врага (В мс)