# Настройки экрана
WIDTH = 800                                 # Ширина окна
HEIGHT = 600                                # Высота окна
FPS = 60                                    # Кадры в секунду

# Цвета
BLACK = (0, 0, 0)                           # Цвет для фона
WHITE = (255, 255, 255)                     # Цвет для текста
RED = (255, 0, 0)                           # Цвет счётчика жизней

# Настройки игрока
PLAYER_SPEED = 5                            # Скорость корабля
PLAYER_LIVES = 3                            # Кол-во жизней

# Настройки пуль
BULLET_SPEED = -10                          # Отрицательное значение — пуля летит вверх

# Настройки врагов
ENEMY_MIN_SPEED = 2                         # Минимальная скорость врага
ENEMY_MAX_SPEED = 5                         # Максимальная скорость врага
ENEMY_SPAWN_DELAY = 1000                    # Скорость появления врага (В мс)

# Музыка и звуки
SOUND_SHOOT = "assets/shoot.wav"            # Звук выстрела
MUSIC_PATH = "assets/background_music.ogg"  # Фоновая музыка